XKCANO/ceshi0223/KD001-0115C/Library/inc/fm33lf0xx_fl_dma.h
#define    DMA_CFGR_FTIE_Pos                                      (2U)
#define    DMA_CFGR_FTIE_Msk                                      (0x1U << DMA_CFGR_FTIE_Pos)
#define    DMA_CFGR_FTIE                                          DMA_CFGR_FTIE_Msk

#define    DMA_CFGR_HTIE_Pos                                      (1U)
#define    DMA_CFGR_HTIE_Msk                                      (0x1U << DMA_CFGR_HTIE_Pos)
#define    DMA_CFGR_HTIE                                          DMA_CFGR_HTIE_Msk

#define    DMA_CFGR_DIR_Pos                                       (0U)
#define    DMA_CFGR_DIR_Msk                                       (0x1U << DMA_CFGR_DIR_Pos)
#define    DMA_CFGR_DIR                                           DMA_CFGR_DIR_Msk

#define    DMA_CH7CR_PRI_Pos                                       (12U)
#define    DMA_CH7CR_PRI_Msk                                       (0x3U << DMA_CH7CR_PRI_Pos)
#define    DMA_CH7CR_PRI                                           DMA_CH7CR_PRI_Msk

#define    DMA_CH7CR_DIR_Pos                                      (10U)
#define    DMA_CH7CR_DIR_Msk                                      (0x1UL << DMA_CH7CR_DIR_Pos)
#define    DMA_CH7CR_DIR                                          DMA_CH7CR_DIR_Msk

#define    DMA_CH7CR_RINC_Pos                                     (9U)
#define    DMA_CH7CR_RINC_Msk                                     (0x1U << DMA_CH7CR_RINC_Pos)
#define    DMA_CH7CR_RINC                                         DMA_CH7CR_RINC_Msk

#define    DMA_CH7CR_FINC_Pos                                     (8U)
#define    DMA_CH7CR_FINC_Msk                                     (0x1U << DMA_CH7CR_FINC_Pos)
#define    DMA_CH7CR_FINC                                         DMA_CH7CR_FINC_Msk

#define    DMA_GCR_ADDRERR_IE_Pos                                 (1U)
#define    DMA_GCR_ADDRERR_IE_Msk                                 (0x1U << DMA_GCR_ADDRERR_IE_Pos)
#define    DMA_GCR_ADDRERR_IE                                     DMA_GCR_ADDRERR_IE_Msk

#define    DMA_GCR_EN_Pos                                         (0U)
#define    DMA_GCR_EN_Msk                                         (0x1U << DMA_GCR_EN_Pos)
#define    DMA_GCR_EN                                             DMA_GCR_EN_Msk

//#define    DMA_CFGR_PRI_Pos                                       (0U)
//#define    DMA_CFGR_PRI_Msk                                       (0x7fU << DMA_CFGR_PRI_Pos)

#define    DMA_ISR_ADDRERR_Pos                                    (17U)
#define    DMA_ISR_ADDRERR_Msk                                    (0x1U << DMA_ISR_ADDRERR_Pos)
#define    DMA_ISR_ADDRERR                                        DMA_ISR_ADDRERR_Msk

#define    DMA_ISR_CHFT_Pos                                       (8U)
#define    DMA_ISR_CHFT_Msk                                       (0x1U << DMA_ISR_CHFT_Pos)
#define    DMA_ISR_CHFT                                           DMA_ISR_CHFT_Msk

#define    DMA_ISR_CHHT_Pos                                       (0U)
#define    DMA_ISR_CHHT_Msk                                       (0x1U << DMA_ISR_CHHT_Pos)
#define    DMA_ISR_CHHT                                           DMA_ISR_CHHT_Msk



#define    FL_DMA_CHANNEL_0                                       (0x0U << 0U)
#define    FL_DMA_CHANNEL_1                                       (0x1U << 0U)
#define    FL_DMA_CHANNEL_2                                       (0x2U << 0U)
#define    FL_DMA_CHANNEL_3                                       (0x3U << 0U)
#define    FL_DMA_CHANNEL_7                                       (0x7U << 0U)



#define    FL_DMA_MEMORY_INC_MODE_UNEXCHANGE                         (0x0U << DMA_CHCR_MINC_Pos)
#define    FL_DMA_MEMORY_INC_MODE_INCREASE                           (0x1U << DMA_CHCR_MINC_Pos)
#define    FL_DMA_MEMORY_INC_MODE_DECREASE                           (0x2U << DMA_CHCR_MINC_Pos)


#define    FL_DMA_PERIPHERAL_INC_MODE_UNEXCHANGE                  (0x0U << DMA_CHCR_PINC_Pos)
#define    FL_DMA_PERIPHERAL_INC_MODE_INCREASE                    (0x1U << DMA_CHCR_PINC_Pos)
#define    FL_DMA_PERIPHERAL_INC_MODE_DECREASE                    (0x2U << DMA_CHCR_PINC_Pos)


#define    FL_DMA_CHANNEL_SPI0_RX                                 (0x0U << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_SPI1_RX                                 (0x1U << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_SPI0_TX                                 (0x2U << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_SPI1_TX                                 (0x3U << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_UART0_RX                                (0x4U << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_UART1_RX                                (0x5U << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_UART2_RX                                (0x6U << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_UART3_RX                                (0x7U << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_UART4_RX                                (0x8U << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_UART0_TX                                (0x9U << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_UART1_TX                                (0xaU << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_UART2_TX                                (0xbU << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_UART3_TX                                (0xcU << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_UART4_TX                                (0xdU << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_LPUART0_RX                              (0xeU << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_LPUART1_RX                              (0xfU << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_LPUART0_TX                              (0x10U << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_LPUART1_TX                              (0x11U << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_I2C_SMB0_RX                             (0x12U << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_I2C_SMB1_RX                             (0x13U << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_I2C_SMB0_TX                             (0x14U << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_I2C_SMB1_TX                             (0x15U << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_AES_IN                                  (0x16U << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_AES_OUT                                 (0x17U << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_CRC                                     (0x18U << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_ATIM0_CH1                               (0x19U << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_ATIM0_CH2                               (0x1aU << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_ATIM0_CH3                               (0x1bU << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_ATIM0_CH4                               (0x1cU << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_ATIM0_TRIG                              (0x1dU << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_ATIM0_COM                               (0x1eU << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_ATIM0_UEV                               (0x1fU << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_GPTIM0_CH1                              (0x20U << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_GPTIM0_CH2                              (0x21U << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_GPTIM0_CH3                              (0x22U << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_GPTIM0_CH4                              (0x23U << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_GPTIM0_TRIG                             (0x24U << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_GPTIM0_UEV                              (0x25U << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_GPTIM1_CH1                              (0x26U << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_GPTIM1_CH2                              (0x27U << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_GPTIM1_CH3                              (0x28U << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_GPTIM1_CH4                              (0x29U << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_GPTIM1_TRIG                             (0x2aU << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_GPTIM1_UEV                              (0x2bU << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_BSTIM0_TRIG                             (0x2cU << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_LPTIM0_TRIG                             (0x2dU << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_ADC_ACQ0                                (0x2eU << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_ADC_ACQ1                                (0x2fU << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_ADC_ACQ2                                (0x30U << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_ADC_ACQ3                                (0x31U << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_ADC_SCANACQ                             (0x32U << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_DAC                                     (0x3cU << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_LED_PWMCR                               (0x3dU << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_LED_DOTDR                               (0x3eU << DMA_CFGR_RSEL_Pos)
#define    FL_DMA_CHANNEL_SWTRIG                                  (0x3fU << DMA_CFGR_RSEL_Pos)


#define    FL_DMA_PRIORITY_LOW                                    (0x0U << DMA_CFGR_PRI_Pos)
#define    FL_DMA_PRIORITY_MEDIUM                                 (0x1U << DMA_CFGR_PRI_Pos)
#define    FL_DMA_PRIORITY_HIGH                                   (0x2U << DMA_CFGR_PRI_Pos)
#define    FL_DMA_PRIORITY_VERYHIGH                               (0x3U << DMA_CFGR_PRI_Pos)


